In [ ]:
pip install psycopg2

In [12]:
# Import dependencies and config data
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
from sqlalchemy import create_engine
from config import username, password, db_name
from IPython.display import display
%matplotlib inline

In [13]:
# Make connection to Postgresql database EmployeeSQL
engine = create_engine(f"postgresql://{username}:{password}@localhost:5432/{db_name}")
connection = engine.connect()

In [21]:
# Import all data from salaries table into DataFrame
salaries_data = pd.read_sql("SELECT * FROM salaries", connection)

# Display titles table
salaries_data.head(10)

   emp_no  salary
0   10001   60117
1   10002   65828
2   10003   40006
3   10004   40054
4   10005   78228
5   10006   40000
6   10007   56724
7   10008   46671
8   10009   60929
9   10010   72488

In [22]:
# Import all data from titles table into DataFrame
titles_data = pd.read_sql("SELECT * FROM titles", connection)

# Display titles table
titles_data.head(10)

  title_id               title
0    s0001               Staff
1    s0002        Senior Staff
2    e0001  Assistant Engineer
3    e0002            Engineer
4    e0003     Senior Engineer
5    e0004    Technique Leader
6    m0001             Manager